Revit 2027 API
BuiltInFailures.SketchFailures.InvalidRoofCurveloopFailure Property
 Base sketch for roof is invalid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRoofCurveloopFailure { get; }
Public Shared ReadOnly Property InvalidRoofCurveloopFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRoofCurveloopFailure {
	FailureDefinitionId^ get ();
}
static member InvalidRoofCurveloopFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace